'use client';

import { Breadcrumbs, BreadcrumbItem } from '@heroui/react';

import { Pages } from '@/@types';

interface IPolicyProps {}

const Policy: React.FC<IPolicyProps> = () => {
  return (
    <section className="py-5 md:py-10 w-full">
      <div className="container">
        <Breadcrumbs className="mb-4">
          <BreadcrumbItem href="/">Головна</BreadcrumbItem>
          <BreadcrumbItem href={`${Pages.POLICY}`}>Політика</BreadcrumbItem>
        </Breadcrumbs>
        <h1 className="text-accent md:text-lg xl:text-xl font-bold text-center mb-2">
          ПОЛІТИКА КОНФІДЕНЦІЙНОСТІ ТА ЗАХИСТУ ПЕРСОНАЛЬНИХ ДАНИХ
        </h1>
        <p className="text-xs md:text-sm xl:text-lg mb-2">
          Управління сайтом https://budstock.com.ua/ (далі – Сайт) здійснюється
          адміністратором сайту (далі за текстом разом іменуються – Виконавець).
          Ця Політика конфіденційності та захисту персональних даних (надалі –
          «Політика») є невід’ємною частиною публічного договору (публічної
          оферти) У цій Політиці визначено порядок здійснення Виконавцем
          оброблення персональних даних, види персональних даних, які
          збираються, цілі використання таких персональних даних, взаємодію
          Виконавця з третіми особами, заходи безпеки для захисту персональних
          даних, умови доступу до персональних даних, а також контактну
          інформацію для користувача щодо отримання доступу, внесення змін,
          блокування або видалення своїх персональних даних та звернення за
          будь-якими питаннями, які можуть виникнути у Замовника щодо практики
          захисту персональних даних.
        </p>
        <h2 className="text-accent md:text-lg xl:text-xl font-semibold text-center mb-2">
          Збір та використання персональних даних
        </h2>
        <p className="text-xs md:text-sm xl:text-lg mb-2">
          Власником та розпорядником персональних даних Замовників
          (користувачів) Сайту є адміністратор сайту.
        </p>
        <h2 className="text-accent md:text-lg xl:text-xl font-semibold text-center mb-2">
          Які дані отримує Виконавець при використанні сервісів Сайту.
        </h2>
        <p className="text-xs md:text-sm xl:text-lg mb-2">
          Виконавець отримуватиме у Замовника наступні персональні дані, за
          посередництвом Сайту, у випадку замовлення послуг чи здійснення
          платежів за наданні сервіси на Сайті, а саме:
          <ul className="pl-2 my-2">
            <li>1. прізвище ім’я по-батькові;</li>
            <li>2. адреса електронної пошти;</li>
            <li>3. номер телефону;</li>
            <li>4. файли cookie;</li>
            <li>5. IP-адреси.</li>
          </ul>
          Отримання від Замовника (передача Замовником) наведених вище даних є
          добровільним та є рівними необхідним для здійснення платіжних
          транзакцій за використання сервісів Сайту та покупок в межах Сайту
          та/або для оформлення підписки на новини Сайту.
        </p>
        <h2 className="text-accent md:text-lg xl:text-xl font-semibold text-center mb-2">
          Використання файлів cookie
        </h2>
        <p className="text-xs md:text-sm xl:text-lg mb-2">
          Cookie – це текстовий файл або файли, що містять невеликий обсяг
          інформації, які надсилаються веб-браузеру і зберігаються на пристрої
          користувача. До таких пристроїв можна віднести комп’ютер, мобільний
          телефон або інший пристрій, за допомогою якого користувач відвідує
          Сайт. Файли cookie можуть бути вічними (вони називаються постійними
          файлами cookie) і зберігатися в комп’ютері, поки користувач їх не
          видалить або тимчасовими (такі файли cookie називаються сесійними),
          тобто зберігаються тільки до закриття браузера. Крім того, файли
          cookie поділяються на основні (вони встановлюються безпосередньо
          відвідуваним Сайтом) і сторонні (встановлюються іншими веб-сайтами).
        </p>
        <h2 className="text-accent md:text-lg xl:text-xl font-semibold text-center mb-2">
          Маркетинг Сайту
        </h2>
        <p className="text-xs md:text-sm xl:text-lg mb-2">
          Якщо Замовник надав згоду на підписку новин Сайту, вказана Замовником
          адреса електронної пошти використовуватиметься в маркетингових цілях
          власних продуктів Сайту. Згоду можна відмінити в будь-який момент.
        </p>
        <h2 className="text-accent md:text-lg xl:text-xl font-semibold text-center mb-2">
          Розповсюдження інформації третім особам
        </h2>
        <p className="text-xs md:text-sm xl:text-lg mb-2">
          Виконавець Сайту не надає доступ до зібраних від Замовника
          персональних даних третім особам. Виконавець докладає всіх можливих
          зусиль, щоб захистити дані Замовників (користувачів) і охороняти їх
          від дій третіх осіб. Проте прийняті нами міри можуть виявитися
          недостатніми, якщо Замовники (користувачі) не дотримуватиметесь правил
          безпеки.
        </p>
        <h2 className="text-accent md:text-lg xl:text-xl font-semibold text-center mb-2">
          Захист персональних даних
        </h2>
        <p className="text-xs md:text-sm xl:text-lg mb-2">
          Виконавець використовує загальноприйняті стандарти технологічного та
          операційного захисту інформації та персональних даних від втрати,
          неправильного використання, зміни або знищення, однак, не гарантує
          абсолютну захищеність від будь-яких загроз, що виникають поза межами
          регулювання Компанії. Виконавець забезпечує застосування всіх
          відповідних зобов’язань щодо дотримання конфіденційності, а також
          технічних і організаційних заходів безпеки для запобігання
          несанкціонованого або незаконного розголошення або обробки такої
          інформації та даних, їх випадкової втрати, знищення або пошкодження.
          Поширення персональних даних без згоди суб’єкта персональних даних або
          уповноваженої ним особи дозволяється у випадках, визначених законом, і
          лише (якщо це необхідно) в інтересах національної безпеки,
          економічного добробуту та прав людини.
        </p>
        <h2 className="text-accent md:text-lg xl:text-xl font-semibold text-center mb-2">
          Права суб’єкта персональних даних
        </h2>
        <p className="text-xs md:text-sm xl:text-lg mb-2">
          Права Користувача (користувачів) як суб’єкта персональних даних
          визначаються Законом України «Про захист персональних даних». Для
          оновлення, отримання доступу, внесення змін, блокування або видалення
          своїх персональних даних, відкликання згоди на обробку персональних
          даних, які були надані Користувачем (користувачами) Виконавцю
          відповідно до цієї Політики, або в разі наявності будь-яких зауважень,
          побажань або претензій щодо персональних даних Користувача
          (користувачів), які обробляються Виконавцем, такий Користувач може
          звернутися до Виконавця електронною поштою за адресою:
          budstock@gmail.com
        </p>
        <h2 className="text-accent md:text-lg xl:text-xl font-semibold text-center mb-2">
          Зміни до цієї Політики
        </h2>
        <p className="text-xs md:text-sm xl:text-lg mb-2">
          Виконавець зберігає за собою право вносити зміни до Політики
          конфіденційності в будь-який час та з будь-якої причини. Будь ласка,
          частіше заходьте на сторінку Політики, щоб не пропустити оновлення та
          зміни в нашій Політиці конфіденційності.
        </p>
      </div>
    </section>
  );
};

export default Policy;
