export const CONFIGURABLE_MATERIAL_LIST_SELECT_PLACEHOLDER_TEXT_MAP: {
  [key: string]: string;
} = {
  'Маяк штукатурний': 'Виберіть товщину металу',
  Газоблок: 'Виберіть розмір',
  Гіпсокартон: 'Виберіть розмір',
  'Профіль для гіпсокартону': 'Виберіть конфігурацію',
  "З'єднувачі для профілю": 'Виберіть товщину металу',
  'П-подібний кронштейн - підвіс': 'Виберіть товщину металу',
  Стрижень: 'Виберіть довжину',
  'Профіль кутовий перфорований': 'Виберіть конфігурацію',
  'Стрічка для швів': 'Виберіть конфігурацію',
  'Стрічка звукоізоляційна': 'Виберіть конфігурацію',
  Саморіз: 'Виберіть конфігурацію',
  Дюбель: 'Виберіть конфігурацію',
  'Вата для перегородок': 'Виберіть розмір',
  'Супутні матеріали': 'Виберіть конфігурацію',
  'Склохолст': 'Виберіть конфігурацію',
  'Мінеральна вата базальтова': 'Виберіть конфігурацію',
  'Мінеральна вата на основі скловолокна': 'Виберіть конфігурацію',
  'Пінопласт': 'Виберіть конфігурацію',
  'Пінополістірол екструдований (стеродур)': 'Виберіть конфігурацію',
  'Дюбель для теплоізоляції': 'Виберіть конфігурацію',
};

